using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace KP_DEZHURSTVA
{
    public partial class PersoneFindForm : Form
    {
        public PersoneFindForm()
        {
            InitializeComponent();
            this.comboBox1.DropDownStyle = System.Windows.Forms.ComboBoxStyle.DropDownList;


            String[,] Persones = new String[,] {
                { "Фадеев Корней Митрофанович", "Группа - 4", "+7(913)549-21-79" },
                { "Галкин Игнатий Протасьевич", "Группа - 4", "+7(913)271-04-28" },
                { "Данилов Макар Еремеевич", "Группа - 4", "+7(913)716-69-80" },
                { "Ильин Моисей Федорович", "Группа - 4", "+7(913)782-47-96" },
                { "Фёдоров Емельян Андреевич", "Группа - 4", "+7(913)196-47-32" },
                { "Попов Всеволод Ростиславович", "Группа - 4", "+7(913)866-77-24" },
                { "Куликов Рудольф Яковлевич", "Группа - 4", "+7(913)579-53-35" },
                { "Владимиров Лазарь Донатович", "Группа - 4", "+7(913)018-34-36" },
                { "Максимов Альфред Григорьевич", "Группа - 4", "+7(913)729-07-33" },
                { "Жданов Мирон Валерьянович", "Группа - 4", "+7(913)559-81-13" },
                { "Киселёва Дарьяна Филипповна", "Группа - 3", "+7(999)887-40-35" },
                { "Хохлова Амалия Антоновна", "Группа - 3", "+7(999)110-60-86" },
                { "Александрова Джема Богуславовна", "Группа - 3", "+7(999)941-76-44" },
                { "Симонова Магда Семёновна", "Группа - 3", "+7(999)113-25-81" },
                { "Горбунова Бронислава Наумовна", "Группа - 3", "+7(999)176-79-34" },
                { "Калинина Георгина Руслановна", "Группа - 3", "+7(999)979-80-37" },
                { "Трофимова Кристина Альбертовна", "Группа - 3", "+7(999)456-10-10" },
                { "Уварова Клавдия Парфеньевна", "Группа - 3", "+7(999)505-08-67" },
                { "Жданова Гелианна Максовна", "Группа - 3", "+7(999)708-70-35" },
                { "Петрова Людмила Леонидовна", "Группа - 3", "+7(961)885-58-58" },
                { "Исаев Виссарион Павлович", "Группа - 2", "+7(905)150-90-98" },
                { "Матвеев Вилен Альбертович", "Группа - 2", "+7(905)842-34-75" },
                { "Силин Богдан Альбертович", "Группа - 2", "+7(905)536-68-17" },
                { "Федосеев Ираклий Федотович", "Группа - 2", "+7(905)782-89-37" },
                { "Юдин Мстислав Семёнович", "Группа - 2", "+7(905)879-96-81" },
                { "Яковлева Милда Евсеевна", "Группа - 2", "+7(905)348-71-44" },
                { "Рябова Эллада Натановна", "Группа - 2", "+7(905)813-62-08" },
                { "Воронова Береслава Якововна", "Группа - 2", "+7(905)918-95-59" },
                { "Гусева Стефания Прокловна", "Группа - 2", "+7(905)393-08-44" },
                { "Боброва Джульетта Денисовна", "Группа - 1", "+7(905)838-08-37" },
                { "Панова Янина Олеговна", "Группа - 1", "+7(905)403-71-17" },
                { "Сазонова Лада Михаиловна", "Группа - 1", "+7(905)250-71-01" },
                { "Мамонтова Ирэна Николаевна", "Группа - 1", "+7(905)044-89-99" },
                { "Шубина Аза Яковлевна", "Группа - 1", "+7(905)389-11-77" },
                { "Андреева Полианна Юлиановна", "Группа - 1", "+7(905)813-92-00" },               
                { "Гурьев Григорий Геннадьевич", "Группа - 1", "+7(905)613-71-52" },
                { "Петухов Михаил Денисович", "Группа - 1", "+7(905)079-07-98" },
                { "Фёдоров Самуил Максович", "Группа - 1", "+7(905)772-94-05" },
                { "Воронов Гордий Николаевич", "Группа - 1", "+7(905)192-40-39" },
                { "Карпов Дональд Васильевич", "Группа - 1", "+7(905)434-59-76" },

            };


            for (int i = 0; i < Persones.Length / 3; i++)
                dataGridView.Rows.Add(Persones[i, 0], Persones[i, 1], Persones[i, 2]);
   

        }

        private void dataGridView1_SelectionChanged(object sender, EventArgs e)
        {
            if (this.dataGridView.SelectedRows.Count == 1)
            {
                this.button3.Enabled = true;
                this.button4.Enabled = true;
                this.button5.Enabled = true;
            }
            else if (this.dataGridView.SelectedRows.Count > 1)
            {
                this.button3.Enabled = false;
                this.button4.Enabled = true;
                this.button5.Enabled = false;
            }
            else
            {
                this.button3.Enabled = false;
                this.button4.Enabled = false;
                this.button5.Enabled = false;
            }
        }

        private void button3_Click(object sender, EventArgs e)
        {
            new PersoneAddForm(is_edit:true).ShowDialog();
        }

        private void button5_Click(object sender, EventArgs e)
        {
            new aboutPersoneForm().ShowDialog();
        }
    }
}
